app/Controllers/Appointments.php

UPDATE `appointments` SET `status` = 'confirmed'
WHERE `appointments`.`id` IN ('5')
---
   public function updateAppointmentStatus()
   {
      $appointmentId = $this->request->getPost('id');
      $newStatus = $this->request->getPost('status');

      $update = $this->AppointmentsModel->update($appointmentId, ['status' => $newStatus]);