app/Controllers/Breeds.php

SELECT `breeds`.`id`, `breeds`.`id_specie`, `breeds`.`name`, `species`.`id` AS `sId`, `species`.`name` AS `spName`
FROM `breeds`
JOIN `species` ON `species`.`id` = `breeds`.`id_specie`
WHERE `breeds`.`id` = '1'
---
   public function show($id = null)
   {
      try {
         $data = $this->BreedsModel->select('breeds.id, breeds.id_specie, breeds.name, species.id AS sId, species.name AS spName')
            ->join('species', 'species.id = breeds.id_specie')
            ->find($id);