app/Controllers/Dashboard.php

    protected function getAppointmentsByDate($date)
    {
        return $this->AppointmentsModel->select('appointments.id, appointments.owner_id, appointments.pet_id, appointments.appointment_date, appointments.appointment_time, appointments.reason, appointments.status, owners.id AS owId, owners.ic, owners.first_name, owners.last_name, owners.email, pets.id AS petId, pets.name')
            ->join('owners', 'owners.id = appointments.owner_id')
            ->join('pets', 'pets.id = appointments.pet_id')
            ->where('appointment_date', $date)
            ->findAll();
---
SELECT `appointments`.`id`, `appointments`.`owner_id`, `appointments`.`pet_id`, `appointments`.`appointment_date`, `appointments`.`appointment_time`, `appointments`.`reason`, `appointments`.`status`, `owners`.`id` AS `owId`, `owners`.`ic`, `owners`.`first_name`, `owners`.`last_name`, `owners`.`email`, `pets`.`id` AS `petId`, `pets`.`name`
FROM `appointments`
JOIN `owners` ON `owners`.`id` = `appointments`.`owner_id`
JOIN `pets` ON `pets`.`id` = `appointments`.`pet_id`
WHERE `appointment_date` = '2024-11-23'