app/Controllers/Invoices.php

SELECT *
FROM `invoices`
WHERE `invoices`.`id` = '12'
---
   public function showInvoiceModal($invoiceId)
   {

      $invoice = $this->InvoicesModel->find($invoiceId);