app/Controllers/MedicalRecords.php

    public function show($petId)
    {
        // Obtener la información de la mascota
        $pet = $this->PetsModel->find($petId);

        if (!$pet) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("La mascota no existe.");
        }

        // Obtener la información del propietario
        $owner = $this->OwnersModel->find($pet['owner_id']);

        if (!$owner) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("El dueño no existe.");
        }

        // Obtener la especie y la raza de la mascota
        $species = $this->SpeciesModel->find($pet['specie_id']);
        $breed = $this->BreedsModel->find($pet['breed_id']);

        // Obtener las pruebas del animal
        $petTests = $this->PetTestsModel->where('pet_id', $petId)->findAll();
        foreach ($petTests as &$test) {
            $test['details'] = $this->TestDetailsModel->where('pet_tests_id', $test['id'])->findAll();
        }

        // Obtener las recetas del animal
        $prescriptions = $this->PrescriptionsModel->where('pet_id', $petId)->findAll();
---
SELECT *
FROM `pets`
WHERE `pets`.`id` = '4'
SELECT *
FROM `owners`
WHERE `owners`.`id` = '1'
SELECT *
FROM `species`
WHERE `species`.`id` = '1'
SELECT *
FROM `breeds`
WHERE `breeds`.`id` = '1'
SELECT *
FROM `pet_tests`
WHERE `pet_id` = '4'
SELECT *
FROM `test_details`
WHERE `pet_tests_id` = '5'
SELECT *
FROM `prescriptions`
WHERE `pet_id` = '4'

        }

        // Obtener las vacunas del animal
        $vaccines = $this->VaccinesModel->where('pet_id', $petId)->findAll();
---
SELECT *
FROM `vaccines`
WHERE `pet_id` = '4'

    public function generatePdf($petId)
    {
        // Obtener la información de la mascota
        $pet = $this->PetsModel->find($petId);

        if (!$pet) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("La mascota no existe.");
        }

        // Obtener la información del propietario
        $owner = $this->OwnersModel->find($pet['owner_id']);

        if (!$owner) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("El dueño no existe.");
        }

        // Obtener la especie y la raza de la mascota
        $species = $this->SpeciesModel->find($pet['specie_id']);
        $breed = $this->BreedsModel->find($pet['breed_id']);

        // Obtener las pruebas del animal
        $petTests = $this->PetTestsModel->where('pet_id', $petId)->findAll();
        foreach ($petTests as &$test) {
            $test['details'] = $this->TestDetailsModel->where('pet_tests_id', $test['id'])->findAll();
        }

        // Obtener las recetas del animal
        $prescriptions = $this->PrescriptionsModel->where('pet_id', $petId)->findAll();
---
SELECT *
FROM `pets`
WHERE `pets`.`id` = '4'
SELECT *
FROM `owners`
WHERE `owners`.`id` = '1'
SELECT *
FROM `species`
WHERE `species`.`id` = '1'
SELECT *
FROM `breeds`
WHERE `breeds`.`id` = '1'
SELECT *
FROM `pet_tests`
WHERE `pet_id` = '4'
SELECT *
FROM `test_details`
WHERE `pet_tests_id` = '5'
SELECT *
FROM `prescriptions`
WHERE `pet_id` = '4'

        }

        // Obtener las vacunas del animal
        $vaccines = $this->VaccinesModel->where('pet_id', $petId)->findAll();
---
SELECT *
FROM `vaccines`
WHERE `pet_id` = '4'