app/Controllers/Owners.php

SELECT *
FROM `pets`
WHERE `owner_id` = '1'
---
   public function getPetsByOwner($owner_id)
   {
      // Obtener las mascotas asociadas al dueño
      $pets = $this->PetsModel->where('owner_id', $owner_id)->findAll();