app/Controllers/Settings.php

SELECT *
FROM `currency`
---
    public function index()
    {
        $data = [
            'controller' => 'settings',
            'title' => 'Ajustes',
            'all_currency' => $this->CurrencyModel->findAll(),