app/Models/AppointmentsModel.php

SELECT COUNT(*) AS `numrows`
FROM `appointments`
JOIN `owners` ON `owners`.`id` = `appointments`.`owner_id`
---
   public function countFilter($search)
   {
      $builder = $this->table($this->table);

      $i = 0;
      foreach ($this->searchFields as $column) {
         if ($search) {
            if ($i == 0) {
               $builder->groupStart()
                  ->like($column, $search);
            } else {
               $builder->orLike($column, $search);
            }

            if (count($this->searchFields) - 1 == $i) $builder->groupEnd();
         }
         $i++;
      }

      return $builder->join('owners', 'owners.id = appointments.owner_id')
         ->countAllResults();