app/Models/BreedsModel.php

   public function filter($search = null, $limit = null, $start = null, $orderField = null, $orderDir = null)
   {
      $builder = $this->table($this->table);

      $i = 0;
      foreach ($this->searchFields as $column) {
         if ($search) {
            if ($i == 0) {
               $builder->groupStart()
                  ->like($column, $search);
            } else {
               $builder->orLike($column, $search);
            }

            if (count($this->searchFields) - 1 == $i) $builder->groupEnd();
         }
         $i++;
      }

      // Muestra datos menores o iguales a las primeras 6 columnas.

      $builder->select('breeds.id, breeds.id_specie, breeds.name, species.id AS sId, species.name AS spName')
         ->join('species', 'species.id = breeds.id_specie')
         ->orderBy($orderField, $orderDir)
         ->limit($limit, $start);

      $query = $builder->get()->getResultArray();
---
SELECT `breeds`.`id`, `breeds`.`id_specie`, `breeds`.`name`, `species`.`id` AS `sId`, `species`.`name` AS `spName`
FROM `breeds`
JOIN `species` ON `species`.`id` = `breeds`.`id_specie`
ORDER BY `spName` DESC
 LIMIT 10

   public function countFilter($search)
   {
      $builder = $this->table($this->table);

      $i = 0;
      foreach ($this->searchFields as $column) {
         if ($search) {
            if ($i == 0) {
               $builder->groupStart()
                  ->like($column, $search);
            } else {
               $builder->orLike($column, $search);
            }

            if (count($this->searchFields) - 1 == $i) $builder->groupEnd();
         }
         $i++;
      }

      return $builder->join('species', 'species.id = breeds.id_specie')
         ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `breeds`
JOIN `species` ON `species`.`id` = `breeds`.`id_specie`