app/Models/InvoicesModel.php

SELECT `invoices`.`id`, `invoices`.`client_id`, `invoices`.`date_invoice`, `invoices`.`invoice_total`, `invoices`.`invoice_subtotal`, `invoices`.`tax`, `invoices`.`amount_paid`, `invoices`.`amount_due`, `invoices`.`notes`, `invoices`.`created_at`, `invoices`.`updated_at`, `invoices`.`uuid`, `owners`.`id` AS `owId`, `owners`.`ic`, `owners`.`first_name`, `owners`.`last_name`, `owners`.`email`, `owners`.`address`, `owners`.`phone`
FROM `invoices`
JOIN `owners` ON `owners`.`id` = `invoices`.`client_id`
ORDER BY `uuid` DESC
 LIMIT 10
---
   public function filter($search = null, $limit = null, $start = null, $orderField = null, $orderDir = null)
   {
      $builder = $this->table($this->table);

      $i = 0;
      foreach ($this->searchFields as $column) {
         if ($search) {
            if ($i == 0) {
               $builder->groupStart()
                  ->like($column, $search);
            } else {
               $builder->orLike($column, $search);
            }

            if (count($this->searchFields) - 1 == $i) $builder->groupEnd();
         }
         $i++;
      }

      // Muestra datos menores o iguales a las primeras 6 columnas.

      $builder->select('invoices.id, invoices.client_id, invoices.date_invoice, invoices.invoice_total, invoices.invoice_subtotal, invoices.tax, invoices.amount_paid, invoices.amount_due, invoices.notes, invoices.created_at, invoices.updated_at, invoices.uuid, owners.id AS owId, owners.ic, owners.first_name, owners.last_name, owners.email, owners.address, owners.phone')
         ->join('owners', 'owners.id = invoices.client_id')
         ->orderBy($orderField, $orderDir)
         ->limit($limit, $start);

      $query = $builder->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `invoices`
JOIN `owners` ON `owners`.`id` = `invoices`.`client_id`
---
   public function countFilter($search)
   {
      $builder = $this->table($this->table)
         ->join('owners', 'owners.id = invoices.client_id');

      $i = 0;
      foreach ($this->searchFields as $column) {
         if ($search) {
            if ($i == 0) {
               $builder->groupStart()
                  ->like($column, $search);
            } else {
               $builder->orLike($column, $search);
            }

            if (count($this->searchFields) - 1 == $i) $builder->groupEnd();
         }
         $i++;
      }

      return $builder->countAllResults();