app/Models/InvoiceDetailsModel.php

   public function filter($search = null, $limit = null, $start = null, $orderField = null, $orderDir = null)
   {
      $builder = $this->table($this->table);

      $i = 0;
      foreach ($this->searchFields as $column) {
         if ($search) {
            if ($i == 0) {
               $builder->groupStart()
                  ->like($column, $search);
            } else {
               $builder->orLike($column, $search);
            }

            if (count($this->searchFields) - 1 == $i) $builder->groupEnd();
         }
         $i++;
      }

      // Muestra datos menores o iguales a las primeras 6 columnas.

      $builder->select('invoice_details.id, invoice_details.invoice_id, invoice_details.product_id,invoice_details.product_name, invoice_details.quantity, invoice_details.price, invoices.id AS invoId, invoices.client_id, invoices.date_invoice')
         ->join('invoices', 'invoices.id = invoice_details.invoice_id')
         ->orderBy($orderField, $orderDir)
         ->limit($limit, $start);

      $query = $builder->get()->getResultArray();
---
SELECT `invoice_details`.`id`, `invoice_details`.`invoice_id`, `invoice_details`.`product_id`, `invoice_details`.`product_name`, `invoice_details`.`quantity`, `invoice_details`.`price`, `invoices`.`id` AS `invoId`, `invoices`.`client_id`, `invoices`.`date_invoice`
FROM `invoice_details`
JOIN `invoices` ON `invoices`.`id` = `invoice_details`.`invoice_id`
ORDER BY `invoice_id` DESC
 LIMIT 10

   public function countFilter($search)
   {
      $builder = $this->table($this->table);

      $i = 0;
      foreach ($this->searchFields as $column) {
         if ($search) {
            if ($i == 0) {
               $builder->groupStart()
                  ->like($column, $search);
            } else {
               $builder->orLike($column, $search);
            }

            if (count($this->searchFields) - 1 == $i) $builder->groupEnd();
         }
         $i++;
      }

      return $builder->join('invoices', 'invoices.id = invoice_details.invoice_id')
         ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `invoice_details`
JOIN `invoices` ON `invoices`.`id` = `invoice_details`.`invoice_id`