app/Models/PetsModel.php

   public function filter($search = null, $limit = null, $start = null, $orderField = null, $orderDir = null)
   {
      $builder = $this->table($this->table);

      $i = 0;
      foreach ($this->searchFields as $column) {
         if ($search) {
            if ($i == 0) {
               $builder->groupStart()
                  ->like($column, $search);
            } else {
               $builder->orLike($column, $search);
            }

            if (count($this->searchFields) - 1 == $i) $builder->groupEnd();
         }
         $i++;
      }

      // Muestra datos menores o iguales a las primeras 6 columnas.

      $builder->select('pets.id, pets.owner_id, pets.name AS pName, pets.photo, pets.sex, pets.weight, pets.weight_unit, pets.age, breeds.id AS bId, breeds.id_specie, breeds.name AS brName, species.id AS sId, species.name AS spName, species.description, owners.id AS oId, owners.ic, owners.first_name, owners.last_name, owners.email, owners.address, owners.phone')
         ->join('owners', 'owners.id = pets.owner_id')
         ->join('species', 'species.id = pets.specie_id')
         ->join('breeds', 'breeds.id = pets.breed_id')
         ->orderBy($orderField, $orderDir)
         ->limit($limit, $start);

      $query = $builder->get()->getResultArray();
---
SELECT `pets`.`id`, `pets`.`owner_id`, `pets`.`name` AS `pName`, `pets`.`photo`, `pets`.`sex`, `pets`.`weight`, `pets`.`weight_unit`, `pets`.`age`, `breeds`.`id` AS `bId`, `breeds`.`id_specie`, `breeds`.`name` AS `brName`, `species`.`id` AS `sId`, `species`.`name` AS `spName`, `species`.`description`, `owners`.`id` AS `oId`, `owners`.`ic`, `owners`.`first_name`, `owners`.`last_name`, `owners`.`email`, `owners`.`address`, `owners`.`phone`
FROM `pets`
JOIN `owners` ON `owners`.`id` = `pets`.`owner_id`
JOIN `species` ON `species`.`id` = `pets`.`specie_id`
JOIN `breeds` ON `breeds`.`id` = `pets`.`breed_id`
ORDER BY `first_name` DESC
 LIMIT 10

   public function countFilter($search)
   {
      $builder = $this->table($this->table);

      // Búsqueda filtrada
      if ($search) {
         $builder->groupStart();
         foreach ($this->searchFields as $i => $column) {
            if ($i === 0) {
               $builder->like($column, $search);
            } else {
               $builder->orLike($column, $search);
            }
         }
         $builder->groupEnd();
      }

      return $builder->select('pets.*, breeds.id, breeds.id_specie, breeds.name, species.id, species.name, species.description, owners.id, owners.first_name, owners.last_name')
         ->join('owners', 'owners.id = pets.owner_id')
         ->join('species', 'species.id = pets.specie_id')
         ->join('breeds', 'breeds.id = pets.breed_id')
         ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pets`
JOIN `owners` ON `owners`.`id` = `pets`.`owner_id`
JOIN `species` ON `species`.`id` = `pets`.`specie_id`
JOIN `breeds` ON `breeds`.`id` = `pets`.`breed_id`