app/Models/PetTestsModel.php

   public function filter($search = null, $limit = null, $start = null, $orderField = null, $orderDir = null)
   {
      $builder = $this->table($this->table);

      $i = 0;
      foreach ($this->searchFields as $column) {
         if ($search) {
            if ($i == 0) {
               $builder->groupStart()
                  ->like($column, $search);
            } else {
               $builder->orLike($column, $search);
            }

            if (count($this->searchFields) - 1 == $i) $builder->groupEnd();
         }
         $i++;
      }

      // Muestra datos menores o iguales a las primeras 6 columnas.

      $builder->select('pet_tests.id, pet_tests.pet_id, pet_tests.test_date, pet_tests.notes_test, pet_tests.created_at, pet_tests.updated_at, pets.id AS petId, pets.owner_id, pets.name, pets.sex, pets.age, pets.weight, pets.weight_unit')
         ->join('pets', 'pets.id = pet_tests.pet_id')
         ->orderBy($orderField, $orderDir)
         ->limit($limit, $start);

      $query = $builder->get()->getResultArray();
---
SELECT `pet_tests`.`id`, `pet_tests`.`pet_id`, `pet_tests`.`test_date`, `pet_tests`.`notes_test`, `pet_tests`.`created_at`, `pet_tests`.`updated_at`, `pets`.`id` AS `petId`, `pets`.`owner_id`, `pets`.`name`, `pets`.`sex`, `pets`.`age`, `pets`.`weight`, `pets`.`weight_unit`
FROM `pet_tests`
JOIN `pets` ON `pets`.`id` = `pet_tests`.`pet_id`
ORDER BY `test_date` ASC
 LIMIT 10

   public function countTotal()
   {
      // Conteo total de registros
      return $this->table($this->table)
         ->join('pets', 'pets.id = pet_tests.pet_id')
         ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pet_tests`
JOIN `pets` ON `pets`.`id` = `pet_tests`.`pet_id`

   public function countFilter($search = null)
   {
      $builder = $this->table($this->table)
         ->join('pets', 'pets.id = pet_tests.pet_id');

      // Aplicar filtros de búsqueda si se proporciona un término de búsqueda
      if ($search) {
         $builder->groupStart();
         foreach ($this->searchFields as $i => $column) {
            if ($i === 0) {
               $builder->like($column, $search);
            } else {
               $builder->orLike($column, $search);
            }
         }
         $builder->groupEnd();
      }

      // Contar los resultados filtrados
      return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pet_tests`
JOIN `pets` ON `pets`.`id` = `pet_tests`.`pet_id`